app/Http/Controllers/ProjectController.php

select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 5 and `projects`.`workspace` = 1
---
    public function index($slug)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($objUser->getGuard() == 'client') {
            $projects = Project::select('projects.*')->join('client_projects', 'projects.id', '=', 'client_projects.project_id')->where('client_projects.client_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        } else {
            $projects = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();

select * from `users` where `users`.`id` in (5)
select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 5 and `projects`.`workspace` = 1 and `projects`.`id` = '1' limit 1
---
    public function show($slug, $projectID)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($objUser && $currentWorkspace) {
            if ($objUser->getGuard() == 'client') {
                $project = Project::select('projects.*')->join('client_projects', 'projects.id', '=', 'client_projects.project_id')->where('client_projects.client_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->with('activities.user')->first();
            } else {
                $project = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->with('activities.user')->first();

select * from `stages` where `workspace_id` = 1 order by `order` asc
---
    public function getProjectChart($arrParam)
    {
        $workspaceId = $arrParam['workspace_id'];
        $projectId = $arrParam['project_id'] ?? null;
        $duration = $arrParam['duration'] ?? null;

        // Initialize the array to store task counts for each stage
        $taskCounts = [];

        // Determine the date range based on the duration
        if ($duration === 'week') {
            $previousWeek = Utility::getFirstSeventhWeekDay(-1);


            foreach ($previousWeek['datePeriod'] as $dateObject) {
                $date = $dateObject->format('Y-m-d');
                $dayName = $dateObject->format('D');
                $taskCounts[$dayName] = Stage::getTaskCountsForDate($workspaceId, $projectId, $date);
            }
        }

        // Get stage names and colors
        $stages = Stage::where('workspace_id', $workspaceId)->orderBy('order')->get();

select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 5 and `projects`.`workspace` = 1 and `projects`.`id` = '1' limit 1
---
    public function edit($slug, $projectID)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $project = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();

select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 5 and `projects`.`workspace` = 1 and `projects`.`id` = '1' limit 1
select * from `stages` where `workspace_id` = 1 order by `order` asc
---
    public function taskBoard($slug, $projectID)
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        $objUser = Auth::user();

        if ($objUser && $currentWorkspace) {

            if ($objUser->getGuard() == 'client') {
                $project = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
            } else {
                $project = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
            }

            if ($project) {
                $stages = $statusClass = [];

                $permissions = Auth::user()->getPermission($projectID);

                if ($project && (isset($permissions) && in_array('show task', $permissions)) || (isset($currentWorkspace) && $currentWorkspace->permission == 'Owner')) {
                    $stages = Stage::where('workspace_id', '=', $currentWorkspace->id)->orderBy('order')->get();

select * from `tasks` where `project_id` = '1' and `status` = 1 order by `order` asc
---
                            }
                        }
                        $task->orderBy('order');
                        $status['tasks'] = $task->where('status', '=', $status->id)->get();

select `projects`.* from `projects` inner join `user_projects` on `user_projects`.`project_id` = `projects`.`id` where `user_projects`.`user_id` = 5 and `projects`.`workspace` = 1 and `projects`.`id` = '1' limit 1
select `projects`.* from `projects` inner join `user_projects` on `user_projects`.`project_id` = `projects`.`id` where `user_projects`.`user_id` = 5 and `projects`.`workspace` = 1
select `users`.* from `users` inner join `user_projects` on `user_projects`.`user_id` = `users`.`id` where `project_id` = '1'
---
    public function taskCreate($slug, $projectID)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($objUser->getGuard() == 'client') {
            $project = Project::select('projects.*')->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
            $projects = Project::select('projects.*')->join('client_projects', 'client_projects.project_id', '=', 'projects.id')->where('client_projects.client_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        } else {
            $project = Project::select('projects.*')->join('user_projects', 'user_projects.project_id', '=', 'projects.id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
            $projects = Project::select('projects.*')->join('user_projects', 'user_projects.project_id', '=', 'projects.id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        }

        $users = User::select('users.*')->join('user_projects', 'user_projects.user_id', '=', 'users.id')->where('project_id', '=', $projectID)->get();

select `projects`.* from `projects` inner join `user_projects` on `user_projects`.`project_id` = `projects`.`id` where `user_projects`.`user_id` = 5 and `projects`.`workspace` = 1 and `projects`.`id` = '1' limit 1
select `projects`.* from `projects` inner join `user_projects` on `user_projects`.`project_id` = `projects`.`id` where `user_projects`.`user_id` = 5 and `projects`.`workspace` = 1
select `users`.* from `users` inner join `user_projects` on `user_projects`.`user_id` = `users`.`id` where `project_id` = '1'
select * from `tasks` where `tasks`.`id` = '1' limit 1
---
    public function taskEdit($slug, $projectID, $taskId)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        if ($objUser->getGuard() == 'client') {
            $project = Project::select('projects.*')->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
            $projects = Project::select('projects.*')->join('client_projects', 'client_projects.project_id', '=', 'projects.id')->where('client_projects.client_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        } else {
            $project = Project::select('projects.*')->join('user_projects', 'user_projects.project_id', '=', 'projects.id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
            $projects = Project::select('projects.*')->join('user_projects', 'user_projects.project_id', '=', 'projects.id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        }
        $users = User::select('users.*')->join('user_projects', 'user_projects.user_id', '=', 'users.id')->where('project_id', '=', $projectID)->get();
        $task = Task::find($taskId);

select `timesheets`.* from `timesheets` inner join `projects` on `projects`.`id` = `timesheets`.`project_id` inner join `tasks` on `tasks`.`id` = `timesheets`.`task_id` where `projects`.`workspace` = 1
---
    public function timesheet($slug)
    {
        $project_id = '-1';

        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $objUser = Auth::user();


        if ($currentWorkspace) {

            if ($objUser->getGuard() == 'client') {
                $timesheets = Timesheet::select('timesheets.*')->join('projects', 'projects.id', '=', 'timesheets.project_id')->join('tasks', 'tasks.id', '=', 'timesheets.task_id')->join('client_projects', 'projects.id', '=', 'client_projects.project_id')->where('client_projects.client_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('client_projects.permission', 'LIKE', '%show timesheet%')->get();
            } elseif ($currentWorkspace->permission == 'Owner') {
                $timesheets = Timesheet::select('timesheets.*')->join('projects', 'projects.id', '=', 'timesheets.project_id')->join('tasks', 'tasks.id', '=', 'timesheets.task_id')->where('projects.workspace', '=', $currentWorkspace->id)->get();

select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 5 and `projects`.`workspace` = 1
select * from `stages` where `workspace_id` = 1 order by `order` asc
select `users`.* from `users` inner join `user_workspaces` on `user_workspaces`.`user_id` = `users`.`id` where `user_workspaces`.`workspace_id` = 1
---
    public function allTasks($slug)
    {
        $userObj = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        if ($userObj->getGuard() == 'client') {
            $projects = Project::select('projects.*')->join('client_projects', 'projects.id', '=', 'client_projects.project_id')->where('client_projects.client_id', '=', $userObj->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        } else {
            $projects = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $userObj->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        }
        $stages = Stage::where('workspace_id', '=', $currentWorkspace->id)->orderBy('order')->get();
        $users = User::select('users.*')->join('user_workspaces', 'user_workspaces.user_id', '=', 'users.id')->where('user_workspaces.workspace_id', '=', $currentWorkspace->id)->get();

select * from `projects` where `projects`.`id` in (1)
---
                ]
            );
        }
        $tasks = $tasks->with('project')->get();

select `permission` from `user_workspaces` where `user_id` = 5 and `workspace_id` = 1 limit 1
---
    public function filterTimesheetTableView(Request $request, $slug)
    {
        //$project = Project::find($request->project_id);

        $tasks = [];
        $week = $request->week;
        $project_id = $request->project_id;


        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $objUser = Auth::user();

        if (!$objUser && $project) {
            $objUser = User::find($project->created_by);
        }

        if (!$objUser) {
            $objUser = $currentWorkspace->owner($currentWorkspace->id);
        }

        if ($objUser->getGuard() != 'client') {
            $permission = UserWorkspace::where('user_id', $objUser->id)
                ->where('workspace_id', $objUser->currant_workspace)
                ->value('permission');