app/Http/Controllers/ProjectReportController.php

select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 5 and `projects`.`workspace` = 1
select * from `stages` where `workspace_id` = 1 order by `order` asc
select `users`.* from `users` inner join `user_workspaces` on `user_workspaces`.`user_id` = `users`.`id` where `user_workspaces`.`workspace_id` = 1
---
    public function index($slug)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);


        if ($objUser && $currentWorkspace) {

            if ($objUser->getGuard() == 'client') {
                $projects = Project::select('projects.*')->join('client_projects', 'projects.id', '=', 'client_projects.project_id')->where('client_projects.client_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
            } else {
                $projects = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
            }

            $stages = Stage::where('workspace_id', '=', $currentWorkspace->id)->orderBy('order')->get();
            $users = User::select('users.*')->join('user_workspaces', 'user_workspaces.user_id', '=', 'users.id')->where('user_workspaces.workspace_id', '=', $currentWorkspace->id)->get();

select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 5 and `projects`.`workspace` = 1 and `projects`.`id` = '1' limit 1
select count(tasks.id) as count, name from `stages` inner join `tasks` on `tasks`.`status` = `stages`.`id` where `workspace_id` = 1 and `tasks`.`project_id` = '1' group by `name`
select count(*) as aggregate from `tasks` where `project_id` = '1'
---
    public function show(Request $request, $slug, $id)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);


        if ($objUser && $currentWorkspace) {
            if ($objUser->getGuard() == 'client') {
                $project = Project::select('projects.*')->join('client_projects', 'projects.id', '=', 'client_projects.project_id')->where('client_projects.client_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $id)->first();
            } else {
                $project = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $id)->first();
            }
        }
        if ($project) {
            $chartData = $this->getProjectChart(
                [
                    'workspace_id' => $currentWorkspace->id,
                    'project_id' => $id,
                    'duration' => 'week',
                ]
            );
            $daysleft = round((((strtotime($project->end_date) - strtotime(date('Y-m-d'))) / 24) / 60) / 60);

            $project_status_task = stage::join("tasks", "tasks.status", "=", "stages.id")->where("workspace_id", "=", $currentWorkspace->id)->where('tasks.project_id', '=', $id)->groupBy('name')->selectRaw('count(tasks.id) as count, name')->pluck('count', 'name');

            $totaltask = Task::where('project_id', $id)->count();

select count(id) as count, priority from `tasks` where `project_id` = '1' group by `priority`
---
                }
            }

            $project_priority_task = Task::where('project_id', $id)->groupBy('priority')->selectRaw('count(id) as count, priority')->pluck('count', 'priority');

select * from `stages` where `workspace_id` = 1 order by `order` asc
select `users`.* from `users` inner join `user_workspaces` on `user_workspaces`.`user_id` = `users`.`id` where `user_workspaces`.`workspace_id` = 1
select * from `milestones` where `project_id` = '1'
---
            ]);


            $stages = Stage::where('workspace_id', '=', $currentWorkspace->id)->orderBy('order')->get();
            $users = User::select('users.*')->join('user_workspaces', 'user_workspaces.user_id', '=', 'users.id')->where('user_workspaces.workspace_id', '=', $currentWorkspace->id)->get();

            $milestones = Milestone::where('project_id', $id)->get();

select * from `tasks` where `project_id` = '1'
select * from `timesheets` where `task_id` = 1 and `project_id` = '1'
---
            $logged_hour = 0;


            $tasks = Task::where('project_id', $id)->get();

            $data = [];
            foreach ($tasks as $task) {
                $timesheets_task = Timesheet::where('task_id', $task->id)->where('project_id', $id)->get();

select `name`, `id` from `stages` where `workspace_id` = 1 order by `order` asc
select `color` from `stages` where `workspace_id` = 1 order by `order` asc
select `status`, count(*) as total from `tasks` where date(`updated_at`) = '2024-06-10' and `project_id` = '1' and `project_id` in (select `id` from `projects` where `workspace` = 1) group by `status`
---
    public function getProjectChart($arrParam)
    {
        $arrDuration = [];
        if ($arrParam['duration'] && $arrParam['duration'] == 'week') {
            $previous_week = Utility::getFirstSeventhWeekDay(-1);
            foreach ($previous_week['datePeriod'] as $dateObject) {
                $arrDuration[$dateObject->format('Y-m-d')] = $dateObject->format('D');
            }
        }

        // $arrTask = [
        //     'label' => [],
        //     'color' => [],
        // ];
        $stages = Stage::where('workspace_id', '=', $arrParam['workspace_id'])->orderBy('order');
        $stageNames = $stages->pluck('name', 'id')->toArray();
        $stageColors = $stages->pluck('color')->toArray();
        $arrTask = [
            'label' => [],
            'color' => $stageColors,
        ];

        foreach ($arrDuration as $date => $label) {
            $data = Task::select('status', DB::raw('count(*) as total'))
                ->whereDate('updated_at', $date)
                ->when(isset($arrParam['project_id']), function ($query) use ($arrParam) {
                    return $query->where('project_id', $arrParam['project_id']);
                })
                ->when(isset($arrParam['workspace_id']), function ($query) use ($arrParam) {
                    return $query->whereIn('project_id', function ($subQuery) use ($arrParam) {
                        $subQuery->select('id')
                            ->from('projects')
                            ->where('workspace', $arrParam['workspace_id']);
                    });
                })
                ->groupBy('status')
                ->pluck('total', 'status')
                ->all();

select `tasks`.*, `stages`.`name` as `stage`, `stages`.`complete` from `tasks` inner join `stages` on `stages`.`id` = `tasks`.`status` where `project_id` = '1'
---
    public function ajax_tasks_report(Request $request, $slug, $id)
    {
        $userObj = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        $tasks = Task::select(
            [
                'tasks.*',
                'stages.name as stage',
                'stages.complete',
            ]
        )->where('project_id', $id)->join("stages", "stages.id", "=", "tasks.status");


        if ($request->assign_to) {
            $tasks->whereRaw("find_in_set('" . $request->assign_to . "',assign_to)");
        }

        if ($request->priority) {
            $tasks->where('priority', '=', $request->priority);
        }

        if ($request->milestone_id) {
            $tasks->where('milestone_id', '=', $request->milestone_id);
        }
        if ($request->status) {
            $tasks->where('tasks.status', '=', $request->status);

select * from `timesheets` where `project_id` = '1' and `task_id` = 1
---
        $tasks = $tasks->get();
        $data = [];
        foreach ($tasks as $task) {
            $timesheets_task = Timesheet::where('project_id', $id)->where('task_id', $task->id)->get();