app/Http/Controllers/UserController.php

    public function Counter($id)
    {
        $response = [];
        if (!empty($id)) {
            $workspces = Workspace::where('created_by', $id)
                ->selectRaw('COUNT(*) as total_workspace, SUM(CASE WHEN is_active = 0 THEN 1 ELSE 0 END) as disable_workspace, SUM(CASE WHEN is_active = 1 THEN 1 ELSE 0 END) as active_workspace')
                ->first();
            $workspaces = WorkSpace::where('created_by', $id)->get();
            $users_data = [];
            foreach ($workspaces as $workspce) {
                // $users = User::where('created_by', $id)->where('workspace_id', $workspce->id)->selectRaw('COUNT(*) as total_users, SUM(CASE WHEN is_disable = 0 THEN 1 ELSE 0 END) as disable_users, SUM(CASE WHEN is_disable = 1 THEN 1 ELSE 0 END) as active_users')->first();
                $users = UserWorkspace::where('workspace_id', $workspce->id)->where('permission', '!=', 'Owner')->selectRaw('COUNT(*) as total_users, SUM(CASE WHEN is_active = 0 THEN 1 ELSE 0 END) as disable_users, SUM(CASE WHEN is_active = 1 THEN 1 ELSE 0 END) as active_users')->first();
---
select COUNT(*) as total_workspace, SUM(CASE WHEN is_active = 0 THEN 1 ELSE 0 END) as disable_workspace, SUM(CASE WHEN is_active = 1 THEN 1 ELSE 0 END) as active_workspace from `workspaces` where `created_by` = '5' limit 1
select * from `workspaces` where `created_by` = '5'
select COUNT(*) as total_users, SUM(CASE WHEN is_active = 0 THEN 1 ELSE 0 END) as disable_users, SUM(CASE WHEN is_active = 1 THEN 1 ELSE 0 END) as active_users from `user_workspaces` where `workspace_id` = 1 and `permission` != 'Owner' limit 1

    public function index($slug = '')
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        if ($currentWorkspace) {
            $users = User::select('users.*', 'user_workspaces.permission', 'user_workspaces.is_active')->join('user_workspaces', 'user_workspaces.user_id', '=', 'users.id');
            $users->where('user_workspaces.workspace_id', '=', $currentWorkspace->id);
            $users = $users->get();
---
select `users`.*, `user_workspaces`.`permission`, `user_workspaces`.`is_active` from `users` inner join `user_workspaces` on `user_workspaces`.`user_id` = `users`.`id` where `user_workspaces`.`workspace_id` = 1

    public function edit($slug, $id)
    {
        $user = User::find($id);
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $designations=Designation::where('workspace_id',$currentWorkspace->id)->get();
---
select * from `users` where `users`.`id` = '12' limit 1
select * from `designations` where `workspace_id` = 1

    public function update($slug = null, $id = null, Request $request)
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($id) {
            $objUser = User::find($id);
---
select * from `users` where `users`.`id` = '12' limit 1

            $objUser->avatar = $logoName;
        }

        $objUser->save();
---
update `users` set `designation_id` = '1', `users`.`updated_at` = '2024-06-23 12:52:26' where `id` = 12

    public function invite($slug)
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $designations=Designation::where('workspace_id',$currentWorkspace->id)->get();
---
select * from `designations` where `workspace_id` = 1

    public function inviteUser($slug, Request $request)
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        $post = $request->all();
        $name = $post['username'];
        $email = $post['useremail'];
        $designation_id = $post['designation_id'];
        $password = $post['userpassword'];

        $registerUsers = User::where('email', $email)->first();


        if (!$registerUsers) {


            $objUser = \Auth::user();
            $arrUser = [];
            $arrUser['name'] = $name;
            $arrUser['email'] = $email;
            $arrUser['designation_id'] = $designation_id;
            $arrUser['email_verified_at'] = date('Y-m-d H:i:s');
            $arrUser['password'] = Hash::make($password);
            $arrUser['currant_workspace'] = $currentWorkspace->id;
            $arrUser['lang'] = $currentWorkspace->lang;
            $registerUsers = User::create($arrUser);
---
select * from `users` where `email` = 'fghfg@gmail.com' limit 1
insert into `users` (`name`, `email`, `designation_id`, `email_verified_at`, `password`, `currant_workspace`, `lang`, `updated_at`, `created_at`) values ('fdgfdgf', 'fghfg@gmail.com', '2', '2024-06-23 12:38:30', '$2y$10$zHVQPB2cdyyWQ.UFJYc2iuG50PUWwgemc0PLqGBxMnmL5fj5N4RO6', 1, 'en', '2024-06-23 12:38:30', '2024-06-23 12:38:30')

        }

        if (!$is_assigned) {
            UserWorkspace::create(
                [
                    'user_id' => $registerUsers->id,
                    'workspace_id' => $currentWorkspace->id,
                    'permission' => 'Member',
                ]
            );
---
insert into `user_workspaces` (`user_id`, `workspace_id`, `permission`, `updated_at`, `created_at`) values (12, 1, 'Member', '2024-06-23 12:38:30', '2024-06-23 12:38:30')

    public function checkUserExists(Request $request, $slug)
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $authuser = Auth::user();
        $authusername = User::where('id', '=', $authuser->id)->first();
        $superAdminEmails = User::where('type', '=', 'admin')->pluck('email')->toArray();
        $setting = Utility::getAdminPaymentSettings();

        if ($request->has('email')) {
            $email = $request->email;
            if (in_array($email, $superAdminEmails)) {
                $response = [
                    'code' => 202,
                    'status' => 'error',
                    'message' => __('You Can Not Add Super Admin As A Normal User.'),
                ];

                return json_encode($response);
            }
            $registerUsers = User::where('email', '=', $email)->first(); //->where('is_active', '=', 1)
        } elseif ($request->has('user_id')) {
            $user_id = $request->user_id;
            $registerUsers = User::find($user_id);
---
select * from `users` where `id` = 5 limit 1
select `email` from `users` where `type` = 'admin'
select * from `users` where `email` = 'fghfg@gmail.com' limit 1