app/Http/Controllers/WorkspaceController.php

    public function settings($slug)
    {
        $objUser          = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        if ($currentWorkspace && $currentWorkspace->created_by == $objUser->id) {
            $taxes     = Tax::where('workspace_id', '=', $currentWorkspace->id)->get();
            $designations     = Designation::where('workspace_id', '=', $currentWorkspace->id)->get();
            $stages    = Stage::where('workspace_id', '=', $currentWorkspace->id)->orderBy('order')->get();
            $bugStages = BugStage::where('workspace_id', '=', $currentWorkspace->id)->orderBy('order')->get();
---
select * from `taxes` where `workspace_id` = 1
select * from `designations` where `workspace_id` = 1
select * from `bug_stages` where `workspace_id` = 1 order by `order` asc
select * from `stages` where `workspace_id` = 1 order by `order` asc

                'ffffff',
                '000000',
            ];
            $EmailTemplates = EmailTemplate::all();
---
select * from `email_templates`

    public function edit_designation($slug, $id){
        $objUser          = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($currentWorkspace->created_by == $objUser->id) {
            $designation = Designation::find($id);
---
select * from `designations` where `designations`.`id` = '2' limit 1

    public function store_designation($slug, Request $request){
        $objUser          = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($currentWorkspace->created_by == $objUser->id) {
            $request->validate([
                'name' => 'required|max:255',
            ]);
            $designation = new Designation();
            $designation->name = $request->name;
            $designation->workspace_id = $currentWorkspace->id;
            $designation->save();
---
insert into `designations` (`name`, `workspace_id`, `updated_at`, `created_at`) values ('IT Manager', 1, '2024-06-23 11:22:42', '2024-06-23 11:22:42')