app/Models/User.php

select count(*) as aggregate from `user_projects` inner join `projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 5 and `projects`.`workspace` = 1
---
        public function countProject($workspace_id = '')
        {
                $count = UserProject::join('projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $this->id);
                if (!empty($workspace_id)) {
                        $count->where('projects.workspace', '=', $workspace_id);
                }

                return $count->count();

select count(*) as aggregate from `workspaces` where `created_by` = 5
---
        public function countWorkspace()
        {
                return Workspace::where('created_by', '=', $this->id)->count();

select count(*) as aggregate from `user_workspaces` inner join `workspaces` on `workspaces`.`id` = `user_workspaces`.`workspace_id` where `workspaces`.`id` in (select `workspace_id` from `user_workspaces` where `permission` = 'Owner' and `user_id` = 5)
---
        public function countUsers($workspace_id)
        {
                $count = UserWorkspace::join('workspaces', 'workspaces.id', '=', 'user_workspaces.workspace_id');
                if (!empty($workspace_id)) {
                        $count->where('workspaces.id', '=', $workspace_id);
                } else {
                        $count->whereIn('workspaces.id', function ($query) {
                                $query->select('workspace_id')->from('user_workspaces')->where('permission', '=', 'Owner')->where('user_id', '=', $this->id);
                        });

select count(*) as aggregate from `client_workspaces` inner join `workspaces` on `workspaces`.`id` = `client_workspaces`.`workspace_id` where `workspaces`.`id` in (select `workspace_id` from `user_workspaces` where `permission` = 'Owner' and `user_id` = 5)
---
        public function countClients($workspace_id)
        {
                $count = ClientWorkspace::join('workspaces', 'workspaces.id', '=', 'client_workspaces.workspace_id');
                if (!empty($workspace_id)) {
                        $count->where('workspaces.id', '=', $workspace_id);
                } else {
                        $count->whereIn('workspaces.id', function ($query) {
                                $query->select('workspace_id')->from('user_workspaces')->where('permission', '=', 'Owner')->where('user_id', '=', $this->id);
                        });

select count(*) as aggregate from `tasks` inner join `projects` on `tasks`.`project_id` = `projects`.`id` where `projects`.`workspace` = 1 and `tasks`.`assign_to` = 5
---
        public function countTask($workspace_id)
        {
                return Task::join('projects', 'tasks.project_id', '=', 'projects.id')->where('projects.workspace', '=', $workspace_id)->where('tasks.assign_to', '=', $this->id)->count();

select `notifications`.* from `notifications` left join `projects` on `notifications`.`related_id` = `projects`.`id` and `notifications`.`type` = 'project_assign' left join `tasks` on `notifications`.`related_id` = `tasks`.`id` and `notifications`.`type` = 'task_assign' left join `bug_reports` on `notifications`.`related_id` = `bug_reports`.`id` and `notifications`.`type` = 'bug_assign' where `user_id` = 5 and `workspace_id` = 1 and `is_read` = 0 order by `notifications`.`id` desc
---
        public function notifications($workspace_id)
        {
            return Notification::select('notifications.*')
                ->with(['user', 'project', 'task', 'bugReport'])
                ->leftJoin('projects', function ($join) {
                    $join->on('notifications.related_id', '=', 'projects.id')
                        ->where('notifications.type', 'project_assign');
                })
                ->leftJoin('tasks', function ($join) {
                    $join->on('notifications.related_id', '=', 'tasks.id')
                        ->where('notifications.type', 'task_assign');
                })
                ->leftJoin('bug_reports', function ($join) {
                    $join->on('notifications.related_id', '=', 'bug_reports.id')
                        ->where('notifications.type', 'bug_assign');
                })
                ->where('user_id', $this->id)
                ->where('workspace_id', $workspace_id)
                ->where('is_read', 0)
                ->orderBy('notifications.id', 'desc')
                ->get();

select * from `user_projects` where `user_id` = 5 and `project_id` = 1 limit 1
---
        public function getPermission($project_id)
        {
                $data = UserProject::where('user_id', '=', $this->id)->where('project_id', '=', $project_id)->first();