app/Models/Utility.php

select `workspaces`.*, `user_workspaces`.`permission` from `workspaces` inner join `user_workspaces` on `workspaces`.`id` = `user_workspaces`.`workspace_id` where `workspaces`.`id` = 1 and `user_id` = 5 limit 1
---
    public static function getWorkspaceBySlug($slug)
    {
        $objUser = Auth::user();

        if ($objUser && $objUser->currant_workspace) {
            if ($objUser->getGuard() == 'client') {
                $rs = Workspace::select(['workspaces.*'])->join('client_workspaces', 'workspaces.id', '=', 'client_workspaces.workspace_id')->where('workspaces.id', '=', $objUser->currant_workspace)->where('client_id', '=', $objUser->id)->first();
            } else {
                $rs = Workspace::select([
                    'workspaces.*',
                    'user_workspaces.permission',
                ])->join('user_workspaces', 'workspaces.id', '=', 'user_workspaces.workspace_id')->where('workspaces.id', '=', $objUser->currant_workspace)->where('user_id', '=', $objUser->id)->first();

select `lang_fullname`, `lang_code` from `languages` where `lang_code` not in ('') or `lang_code` = 'en'
---
    public static function fetchlanguages()
    {
        $settings = Utility::getAdminPaymentSettings();
        $disablelang = $settings['disable_lang'];

        // Use Eloquent to fetch all languages from the database, including English
        $languages = Languages::whereNotIn('lang_code', explode(',', $disablelang))
            ->orWhere('lang_code', 'en') // Include English
            ->pluck('lang_fullname', 'lang_code')
            ->all();

select * from `workspaces` where `id` = 1 limit 1
---
    public static function fetchgetcompanylogo($slug)
    {
        $data = Workspace::where('id', $slug)->first();

select * from `workspaces` where `id` = 1 limit 1
---
    public static function fetchgetcompanySettings($slug)
    {
        $data = Workspace::where('id', $slug)->first();

select * from `languages` where `lang_code` = 'en' limit 1
---
    public static function getlang_fullname($code)
    {

        $languages = Utility::langList();
        if (\Schema::hasTable('languages')) {
            $lang = Languages::where('lang_code', '=', $code)->first();